app/controllers/api/albums_controller.rb

    def show
        # debugger
        @album = Album.find_by(id: params[:id])
---
SELECT "albums".* FROM "albums" WHERE "albums"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]