app/controllers/api/artists_controller.rb

SELECT "artists".* FROM "artists" WHERE "artists"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def show
        @artist = Artist.find_by(id: params[:id])