app/models/user.rb

SELECT "users".* FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "guest@guest.com"], ["LIMIT", 1]]
---
  def self.find_by_credentials(credential, password)
    # user = User.find_by(username: credential) #finds by username not email
    # # has_secure_password gives us the authenticate method
    # if user&.authenticate(password)
    #     return user
    # else
    #     nil
    # end

    user = credential.match?(URI::MailTo::EMAIL_REGEXP) ? User.find_by(email: credential) : User.find_by(username: credential)

SELECT 1 AS one FROM "users" WHERE "users"."session_token" = $1 LIMIT $2  [["session_token", "[FILTERED]"], ["LIMIT", 1]]
---
  def generate_unique_session_token
    while true
      session_token = SecureRandom.urlsafe_base64
      return session_token unless User.exists?(session_token: session_token)